FocusGroup8/FocusLamp_DEMO2/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.4 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32p4"

#
# Serial flasher config
#
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# end of Serial flasher config

#
# Partition Table
#
CONFIG_PARTITION_TABLE_CUSTOM=y
# end of Partition Table

#
# Audio Bridge
#
CONFIG_AUDIO_BRIDGE_DECODE_TASK_CORE=1
CONFIG_AUDIO_BRIDGE_MIC_TASK_STACK_SIZE=32768
# end of Audio Bridge

#
# FocusLamp Bridge
#
CONFIG_FOCUSLAMP_BRIDGE_TARGET_IP="10.132.136.4"
# end of FocusLamp Bridge

#
# MIPI-DSI Bridge
#
CONFIG_MIPI_DSI_BRIDGE_TARGET_IP="10.132.136.143"
# end of MIPI-DSI Bridge

#
# Wake Word Engine
#
CONFIG_WAKE_WORD_ENGINE_DET_THRESHOLD=2000
# end of Wake Word Engine

#
# WebSocket Manager Configuration
#

#
# Client Configuration
#
CONFIG_WS_MANAGER_BUFFER_SIZE=8192
CONFIG_WS_MANAGER_CLIENT_URI="ws://192.168.4.2:8765"
# end of Client Configuration
# end of WebSocket Manager Configuration

#
# WiFi Manager Configuration
#
CONFIG_WIFI_MANAGER_SSID="RT3"
CONFIG_WIFI_MANAGER_PASSWORD="10101010"
CONFIG_WIFI_MANAGER_MAX_RETRY=10
CONFIG_WIFI_MANAGER_USE_STATIC_IP=y
# end of WiFi Manager Configuration

#
# ESP Speech Recognition
#
CONFIG_SR_MN_EN_MULTINET7_QUANT=y
# end of ESP Speech Recognition

#
# Component config
#

#
# Hardware Settings
#

#
# Chip revision
#
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
# end of Chip revision
# end of Hardware Settings

#
# ESP PSRAM
#
CONFIG_SPIRAM=y

#
# PSRAM config
#
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=131072
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
# end of PSRAM config
# end of ESP PSRAM

#
# ESP System Settings
#
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_MAIN_TASK_AFFINITY_NO_AFFINITY=y
# end of ESP System Settings

#
# Wi-Fi
#
CONFIG_ESP_HOST_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=5
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_ESP_WIFI_EXTRA_IRAM_OPT=y
# end of Wi-Fi

#
# LWIP
#

#
# TCP
#
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=32768
CONFIG_LWIP_TCP_OOSEQ_MAX_PBUFS=4
# end of TCP
# end of LWIP

#
# mbedTLS
#
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=4096
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
# end of mbedTLS

#
# LibC
#
CONFIG_LIBC_OPTIMIZED_MISALIGNED_ACCESS=n
# end of LibC

#
# ESP-Hosted config
#

#
# Hosted SDIO Configuration
#
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=13
# end of Hosted SDIO Configuration

CONFIG_ESP_HOSTED_ENABLE_ITWT=n
CONFIG_ESP_HOSTED_MEMPOOL_PREFER_SPIRAM=y
# end of ESP-Hosted config

#
# Wi-Fi Remote
#
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C5=y

#
# Wi-Fi configuration
#
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=10
CONFIG_WIFI_RMT_RX_BA_WIN=6
# end of Wi-Fi configuration
# end of Wi-Fi Remote
# end of Component config
